<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Navicat Premium installer</string>
    <key>Identifier</key>
    <string>com.github.catpele.download.NavicatPremium11</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Navicat Premium</string>
        <key>URL</key>
        <string>http://download3.navicat.com/download/navicat112_premium_en.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Comment</key>
            <string>Download latest Navicat disk image</string>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Navicat Premium.app</string>
                <key>requirement</key>
                <string>identifier "com.prect.NavicatPremium" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = VH7G2MRF27</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
